package com.kh.almin.career.model.service;

import java.util.List;
import java.util.Map;

import com.kh.almin.career.model.vo.MemberNeed;

public interface CareerService {
// ===================================================================================================================
	// calender 첫 page --> 지원일자 조회를 calender 첫 페이지로 결정
	public List<Map<String, String>> selectCalList(String userId) throws Exception;
// ===================================================================================================================
	// 구직 & 면접 일정 입력(insert)
	public int insertNeed(MemberNeed memberNeed) throws Exception;
// ===================================================================================================================
	// 일정 삭제(조건 : 제목, 시작시간. 종료시간)
	public int deleteCal(MemberNeed memberNeed) throws Exception;
// ===================================================================================================================
// ===================================================================================================================
// ===================================================================================================================
}
// ===================================================================================================================
// 회원의 현재 근무지 정보를 가져오는 method
// public List<Map<String, String>> selectAllWork();